{"keras_version": "1.0.7", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "trainable": true, "activation": "relu", "nb_col": 3, "bias": true, "nb_row": 3, "activity_regularizer": null, "input_dtype": "float32", "W_regularizer": null, "name": "convolution2d_5", "W_constraint": null, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "batch_input_shape": [null, 150, 150, 3], "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 32}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_5", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "trainable": true, "activation": "relu", "nb_col": 3, "bias": true, "nb_row": 3, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_6", "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "subsample": [1, 1], "nb_filter": 32}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_6", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "trainable": true, "activation": "relu", "nb_col": 3, "bias": true, "nb_row": 3, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_7", "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "subsample": [1, 1], "nb_filter": 64}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_7", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "name": "dense_3", "W_constraint": null, "output_dim": 64, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "name": "dense_4", "W_constraint": null, "output_dim": 2, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "sigmoid"}}]}